In [1]:
import mysql.connector
import pandas as pd

# Database Connection
mydb = mysql.connector.connect(host = "localhost",user = "ragu",password ="password")
cursor = mydb.cursor()

In [2]:
# Use Database joins
cursor.execute("use joins")

In [3]:
# List of Tables
cursor.execute("show tables")
for x in cursor:
    print(x)

('Iris_petal',)
('Iris_sepal',)
('Iris_species',)
('committees',)
('member',)

In [4]:
# Retrieving data using select
pd.read_sql_query("select * from Iris_petal ",mydb)

      Id  PetalLengthCm  PetalWidthCm Species_Id
0      1            1.4           0.2          A
1      2            1.4           0.2          A
2      3            1.3           0.2          A
3      4            1.5           0.2          A
4      5            1.4           0.2          A
..   ...            ...           ...        ...
145  146            5.2           2.3          C
146  147            5.0           1.9          C
147  148            5.2           2.0          C
148  149            5.4           2.3          C
149  150            5.1           1.8          C

[150 rows x 4 columns]

In [5]:
# Retrieving data using select
pd.read_sql_query("select * from Iris_sepal ",mydb)

      Id  SepalLengthCm  SepalWidthCm Species_Id
0      1            5.1           3.5          A
1      2            4.9           3.0          A
2      3            4.7           3.2          A
3      4            4.6           3.1          A
4      5            5.0           3.6          A
..   ...            ...           ...        ...
145  146            6.7           3.0          C
146  147            6.3           2.5          C
147  148            6.5           3.0          C
148  149            6.2           3.4          C
149  150            5.9           3.0          C

[150 rows x 4 columns]

In [6]:
# Retrieving data using select
pd.read_sql_query("select * from Iris_species ",mydb)

   Id Species_Id          Species
0   1          A      Iris-setosa
1   2          B  Iris-versicolor
2   3          C   Iris-virginica

In [7]:
# Inner join
pd.read_sql_query("select PetalLengthCm , PetalWidthCm, Species from Iris_petal INNER JOIN Iris_species on Iris_petal.Species_Id = Iris_species.Species_Id ",mydb)

     PetalLengthCm  PetalWidthCm         Species
0              1.4           0.2     Iris-setosa
1              1.4           0.2     Iris-setosa
2              1.3           0.2     Iris-setosa
3              1.5           0.2     Iris-setosa
4              1.4           0.2     Iris-setosa
..             ...           ...             ...
145            5.2           2.3  Iris-virginica
146            5.0           1.9  Iris-virginica
147            5.2           2.0  Iris-virginica
148            5.4           2.3  Iris-virginica
149            5.1           1.8  Iris-virginica

[150 rows x 3 columns]

In [8]:
pd.read_sql_query("select PetalWidthCm, Species from Iris_petal INNER JOIN Iris_species on Iris_petal.Species_Id = Iris_species.Species_Id order by 1",mydb)

     PetalWidthCm         Species
0             0.1     Iris-setosa
1             0.1     Iris-setosa
2             0.1     Iris-setosa
3             0.1     Iris-setosa
4             0.1     Iris-setosa
..            ...             ...
145           2.4  Iris-virginica
146           2.4  Iris-virginica
147           2.5  Iris-virginica
148           2.5  Iris-virginica
149           2.5  Iris-virginica

[150 rows x 2 columns]

In [9]:
pd.read_sql_query("select PetalWidthCm, Species from Iris_petal INNER JOIN Iris_species on Iris_petal.Species_Id = Iris_species.Species_Id where Iris_species.species ='Iris-setosa'  ",mydb)

    PetalWidthCm      Species
0            0.2  Iris-setosa
1            0.2  Iris-setosa
2            0.2  Iris-setosa
3            0.2  Iris-setosa
4            0.2  Iris-setosa
5            0.4  Iris-setosa
6            0.3  Iris-setosa
7            0.2  Iris-setosa
8            0.2  Iris-setosa
9            0.1  Iris-setosa
10           0.2  Iris-setosa
11           0.2  Iris-setosa
12           0.1  Iris-setosa
13           0.1  Iris-setosa
14           0.2  Iris-setosa
15           0.4  Iris-setosa
16           0.4  Iris-setosa
17           0.3  Iris-setosa
18           0.3  Iris-setosa
19           0.3  Iris-setosa
20           0.2  Iris-setosa
21           0.4  Iris-setosa
22           0.2  Iris-setosa
23           0.5  Iris-setosa
24           0.2  Iris-setosa
25           0.2  Iris-setosa
26           0.4  Iris-setosa
27           0.2  Iris-setosa
28           0.2  Iris-setosa
29           0.2  Iris-setosa
30           0.2  Iris-setosa
31           0.4  Iris-setosa
32           0.1  Iris-setosa
33           0.2  Iris-setosa
34           0.1  Iris-setosa
35           0.2  Iris-setosa
36           0.2  Iris-setosa
37           0.1  Iris-setosa
38           0.2  Iris-setosa
39           0.2  Iris-setosa
40           0.3  Iris-setosa
41           0.3  Iris-setosa
42           0.2  Iris-setosa
43           0.6  Iris-setosa
44           0.4  Iris-setosa
45           0.3  Iris-setosa
46           0.2  Iris-setosa
47           0.2  Iris-setosa
48           0.2  Iris-setosa
49           0.2  Iris-setosa

In [10]:
pd.read_sql_query("select PetalWidthCm, Species from Iris_petal INNER JOIN Iris_species on Iris_petal.Species_Id = Iris_species.Species_Id  where Iris_species.species ='Iris-setosa' order by 2  ",mydb)

    PetalWidthCm      Species
0            0.2  Iris-setosa
1            0.2  Iris-setosa
2            0.2  Iris-setosa
3            0.2  Iris-setosa
4            0.2  Iris-setosa
5            0.4  Iris-setosa
6            0.3  Iris-setosa
7            0.2  Iris-setosa
8            0.2  Iris-setosa
9            0.1  Iris-setosa
10           0.2  Iris-setosa
11           0.2  Iris-setosa
12           0.1  Iris-setosa
13           0.1  Iris-setosa
14           0.2  Iris-setosa
15           0.4  Iris-setosa
16           0.4  Iris-setosa
17           0.3  Iris-setosa
18           0.3  Iris-setosa
19           0.3  Iris-setosa
20           0.2  Iris-setosa
21           0.4  Iris-setosa
22           0.2  Iris-setosa
23           0.5  Iris-setosa
24           0.2  Iris-setosa
25           0.2  Iris-setosa
26           0.4  Iris-setosa
27           0.2  Iris-setosa
28           0.2  Iris-setosa
29           0.2  Iris-setosa
30           0.2  Iris-setosa
31           0.4  Iris-setosa
32           0.1  Iris-setosa
33           0.2  Iris-setosa
34           0.1  Iris-setosa
35           0.2  Iris-setosa
36           0.2  Iris-setosa
37           0.1  Iris-setosa
38           0.2  Iris-setosa
39           0.2  Iris-setosa
40           0.3  Iris-setosa
41           0.3  Iris-setosa
42           0.2  Iris-setosa
43           0.6  Iris-setosa
44           0.4  Iris-setosa
45           0.3  Iris-setosa
46           0.2  Iris-setosa
47           0.2  Iris-setosa
48           0.2  Iris-setosa
49           0.2  Iris-setosa

In [11]:
pd.read_sql_query("select PetalWidthCm, Species from Iris_petal INNER JOIN Iris_species on Iris_petal.Species_Id = Iris_species.Species_Id  where Iris_species.species ='Iris-setosa' order by 1 limit 10 ",mydb)

   PetalWidthCm      Species
0           0.1  Iris-setosa
1           0.1  Iris-setosa
2           0.1  Iris-setosa
3           0.1  Iris-setosa
4           0.1  Iris-setosa
5           0.1  Iris-setosa
6           0.2  Iris-setosa
7           0.2  Iris-setosa
8           0.2  Iris-setosa
9           0.2  Iris-setosa

In [12]:
pd.read_sql_query("select PetalWidthCm, Species from Iris_petal P INNER JOIN Iris_species S on P.Species_Id = S.Species_Id  where S.species ='Iris-setosa' order by 1 limit 10 ",mydb)

   PetalWidthCm      Species
0           0.1  Iris-setosa
1           0.1  Iris-setosa
2           0.1  Iris-setosa
3           0.1  Iris-setosa
4           0.1  Iris-setosa
5           0.1  Iris-setosa
6           0.2  Iris-setosa
7           0.2  Iris-setosa
8           0.2  Iris-setosa
9           0.2  Iris-setosa

In [13]:
pd.read_sql_query("select PetalWidthCm from Iris_petal INNER JOIN Iris_species",mydb)

     PetalWidthCm
0             0.2
1             0.2
2             0.2
3             0.2
4             0.2
..            ...
445           2.3
446           2.3
447           1.8
448           1.8
449           1.8

[450 rows x 1 columns]

In [14]:
pd.read_sql_query("SELECT * FROM member m INNER JOIN committees c ON c.name = m.name",mydb)

   member_id      name  committees_id      name
0          6      Ragu              5      Ragu
1          7     Vicky              6     Vicky
2          8  Thanigai              7  Thanigai

In [15]:
# INNER JOIN 
pd.read_sql_query("SELECT m.member_id, m.name AS member, c.committees_id,  c.name AS committee FROM member m INNER JOIN committees c ON c.name = m.name",mydb)

   member_id    member  committees_id committee
0          6      Ragu              5      Ragu
1          7     Vicky              6     Vicky
2          8  Thanigai              7  Thanigai

In [16]:
# LEFT JOIN (on)
pd.read_sql_query("SELECT m.member_id, m.name AS member, c.committees_id,  c.name AS committee FROM member m LEFT JOIN committees c ON c.name = m.name",mydb)

   member_id    member  committees_id committee
0          6      Ragu            5.0      Ragu
1          7     Vicky            6.0     Vicky
2          8  Thanigai            7.0  Thanigai
3          9      Deva            NaN      None
4         10     Jegan            NaN      None

In [17]:
# LEFT JOIN (using)
pd.read_sql_query("SELECT m.member_id, m.name AS member, c.committees_id,  c.name AS committee FROM member m LEFT JOIN committees c  using(name) ",mydb)

   member_id    member  committees_id committee
0          6      Ragu            5.0      Ragu
1          7     Vicky            6.0     Vicky
2          8  Thanigai            7.0  Thanigai
3          9      Deva            NaN      None
4         10     Jegan            NaN      None

In [18]:
# LEFT JOIN (using & where)
pd.read_sql_query("SELECT m.member_id, m.name AS member, c.committees_id,  c.name AS committee FROM member m LEFT JOIN committees c  using(name) where c.committees_id is NOT NULL ",mydb)

   member_id    member  committees_id committee
0          6      Ragu              5      Ragu
1          7     Vicky              6     Vicky
2          8  Thanigai              7  Thanigai

In [19]:
# LEFT JOIN (using & where)
pd.read_sql_query("SELECT m.member_id, m.name AS member, c.committees_id,  c.name AS committee FROM member m LEFT JOIN committees c  using(name) where c.committees_id is  NULL ",mydb)

   member_id member committees_id committee
0          9   Deva          None      None
1         10  Jegan          None      None

In [20]:
# RIGHT JOIN 
pd.read_sql_query("SELECT m.member_id, m.name AS member, c.committees_id,  c.name AS committee FROM member m RIGHT JOIN committees c  using(name) ",mydb)

   member_id    member  committees_id committee
0        6.0      Ragu              5      Ragu
1        7.0     Vicky              6     Vicky
2        8.0  Thanigai              7  Thanigai
3        NaN      None              8       vel

In [27]:
# LEFT JOIN (using & where)
pd.read_sql_query("SELECT m.member_id, m.name AS member, c.committees_id,  c.name AS committee FROM member m RIGHT JOIN committees c  using(name) where m.member_id is  not NULL ",mydb)

   member_id    member  committees_id committee
0          6      Ragu              5      Ragu
1          7     Vicky              6     Vicky
2          8  Thanigai              7  Thanigai

In [28]:
# LEFT JOIN (using & where)
pd.read_sql_query("SELECT m.member_id, m.name AS member, c.committees_id,  c.name AS committee FROM member m RIGHT JOIN committees c  using(name) where m.member_id is  NULL ",mydb)

  member_id member  committees_id committee
0      None   None              8       vel

In [31]:
# CROSS JOIN
pd.read_sql_query("select * from member CROSS JOIN  committees ",mydb)

    member_id      name  committees_id      name
0           6      Ragu              8       vel
1           6      Ragu              7  Thanigai
2           6      Ragu              6     Vicky
3           6      Ragu              5      Ragu
4           7     Vicky              8       vel
5           7     Vicky              7  Thanigai
6           7     Vicky              6     Vicky
7           7     Vicky              5      Ragu
8           8  Thanigai              8       vel
9           8  Thanigai              7  Thanigai
10          8  Thanigai              6     Vicky
11          8  Thanigai              5      Ragu
12          9      Deva              8       vel
13          9      Deva              7  Thanigai
14          9      Deva              6     Vicky
15          9      Deva              5      Ragu
16         10     Jegan              8       vel
17         10     Jegan              7  Thanigai
18         10     Jegan              6     Vicky
19         10     Jegan              5      Ragu